<?php
namespace console\migrations;

class m221015_133536_seed
{

    public function up($db)
    {
       $db->query("INSERT INTO `tree` (`id`, `parent_id`, `name`, `description`) 
            VALUES
                ('1', NULL, 'объект 1', 'Описание объекта 1'),
                ('2', '1', 'объект 1.2', 'Описание объекта 1.2'),
                ('3', '1', 'объект 1.3', 'Описание объекта 1.3'),
                ('4', NULL, 'объект 2', 'Описание объекта 2'),
                ('5', '2', 'объект 1.2.1', 'Описание объекта 1.2.1'),
                ('6', '2', 'объект 1.2.2', 'Описание объекта 1.2.2'),
                ('7', '6', 'объект 1.2.2.2', 'Описание объекта 1.2.2.2');"
       );
    }

    public function down($db)
    {
        $db->query("TRUNCATE `tree`");
    }

}